# EnergyAnalysisCreateAnalyticalModel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisCreateAnalyticalModel Property
ParameterTypeId Class See Also
---
"Create Energy Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisCreateAnalyticalModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisCreateAnalyticalModel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace